Repository: saroesler/PageZensor
Catalog: locale/*/LC_MESSAGES/module_pagezensor.po
Languages: de

source: The added Page has no title.
de: Die neue Seite hat keinen Titel.

source: page has been added successfully.
de: Die Seite wurde erfolgreich erstellt.

source: ID is missing.
de: Die ID fehlt.

source: page has been removed successfully.
de: Die Seite wurde erfolgreich gelöscht.

source: Please write the editor something about his problems.
de: Bitte schreiben Sie dem Verfasser, warum diese Änderungen nicht veröffentlicht werden können.

source: Page with id %s not found
de: Es wurde keine passende Seite für ID %s gefunden.

source: Page module with confirmation of every site by an administrator of the pages
de: Seitenmodul mit Freigabe jeder Seitenänderung von den Adminstratoren dieser Seite.

source: Users view
de: Benutzeransicht

source: Page creation
de: Seitenerstellung

source: Main
de: Hauptseite

source: History
de: Historie

source: Page Manager
de: Seitenverwaltung

source: Add and delete pages
de: Erstellen und löschen Sie Seiten.

source: Little HTLM- School
de: Kleine HTLM- Schule

source: Learn HTML, to edit pages professionally
de: Lernen Sie ein bisschen HTML, um Ihre Seiten professionell zu bearbeiten.

source: Help
de: Hilfe

source: Admin page
de: Administrationsseite

source: Last update:
de: Stand:

source: Edit
de: Bearbeiten

source: Could not find a site with this id!
de: Die Seite mit dieser ID konnte nicht gefunden werden!

source: All pages
de: Alle Seiten

source: Little HTML- School
de: Kleine HTML- Schule

source: This modul work with HTML- Tags. To write a text in a right format, you have to use HTML. Here is a schor overview of the general HTML-Tags.
de: Dieses Modul arbeitet mit HTML- Tags. Um den Text richtig zu formatieren, müssen Sie HTML nutzen. Hier ist ein kleiner Überblick über die einfachen HTML- Tags.

source: Title:
de: Titel:

source: There is a hierarchy of titles. You can use highest title by writing '&lt;h1>'Here is my text'&lt;/h1>'. Lower title are created with &lt;h2> and so on.
de: Es gibt eine Hirarchie der Titel. Um ein Haupttitel zu ersetllen nutzen Sie folgenden Tag: '&lt;h1>'Mein Titel'&lt;/h1>'. Unwichtigere Titel werden mit &lt;h2> und so weiter erstellt.

source: To write your text HTML- comformely you have to use a &lt;p> Tag. You use it like this:'&lt;p>My Text&lt;/p>'
de: Um den Text HTML- konform zu schreiben benutzen Sie den &lt;p> Tag. Dies sieht dann so aus: '&lt;p>Mein Text&lt;/p>'

source: Wordwrap
de: Zeilenumbruch

source: To get an new Line you have to use this tag: '&lt;br/>'.
de: Um einen Zeilenumbruch zu erhalten nutzen Sie diesen Tag: '&lt;br/>'.

source: Design a text
de: Textgestaltung

source: To design the text, you can use following Tags:
de: Um eine Text zu gestalten nutzen Sie folgenden Tags:

source: Bold
de: Fett

source: To make your text boldly, you use this tag:'&lt;b>Bold Text&lt;/b>'
de: Um einen Text fett zu machen nutzten Sie diesen Tag: '&lt;b>Fetter Text&lt;/b>'

source: Italic
de: Kusiv

source: To make your text italicly, you use this tag:'&lt;i>Italic Text&lt;/i>'
de: Um einen Text kusiv zu schreiben nutzen Sie diesen Tag:'&lt;i>Kusiver Text&lt;/i>'

source: Underline
de: Unterstreichen

source: To unterline your text, you use this tag:'&lt;u>Underlied Text&lt;/u>'
de: Um einen Text zu unterstreichen nutzen Sie folgenden Tag: '&lt;u>Unterstrichender Text&lt;/u>'

source: Structure a text
de: Textstrukturierung

source: To structure the text, you can use following Tags:
de: Um den Text zu strukturieren können Sie diese Tags nutzen:

source: List with dots
de: Liste mit Punkten

source: To create a list with dots you can use this tag:'&lt;ul>&lt;li>Text in list&lt;/li>&lt;/ul>'. To create more then one list entry you use the &lt;li> tags more the one time.
de: Um eine Liste zu erstellen nutzen Sie diese Tags: '&lt;ul>&lt;li>Text in der Liste&lt;/li>&lt;/ul>'. Wenn Sie mehr als einen Eintrag benötigen, widerholen Sie die &lt;li> Tags.

source: List with numbering
de: Aufzählungen

source: To create a list with numbering you can use this tag:'&lt;ol>&lt;li>Text in list&lt;/li>&lt;/ol>'. To create more then one list entry you use the &lt;li> tags more the one time.
de: Um eine Aufzählung zu erstellen, können Sie folgenden Tag nutzen: '&lt;ol>&lt;li>Text in der Aufzählung&lt;/li>&lt;/ol>'. Um mehr als nur einen Eintrag zu bekommen, widerholen Sie die &lt;li> Tags.

source: Table
de: Tabelle

source: To create a table you can use this tag:'&lt;table>&lt;tr>&lt;th>Title of th column&lt;/th>&lt;td>Text in one cell&lt;/td>&lt;/tr>&lt;/table>'. To create more then one row you use the &lt;tr> tags more the one time. To create more then one column you use the &lt;th> / &lt;td> tags more the one time in each row.
de: Um eine Tabelle zu erstellen nutzen Sie folgeden Tag- Folge: '&lt;table>&lt;tr>&lt;th>Titel der Zeile&lt;/th>&lt;td>Text in einer Zelle&lt;/td>&lt;/tr>&lt;/table>'.Um mehrere Zeilen zu erzeugen, widerholen Sie die &lt;tr> Tags. Um mehrere Spalten zu erzeugen, verwenden Sie mehrere &lt;th> / &lt;td> Tags in einer Zeile.

source: Deviding line
de: Trennlinie

source: To create a deviding line you use this tag: '&lt;hr/>'.
de: Mit '&lt;hr/>' erstellen Sie eine Trennlinie.

source: Hyperlink
de: Link

source: To create a hyperlink you use this tag: &lt;a href="path to the site">the title, you show the sites visitor&lt;/a>
de: Um einen Hyperlink zu erstellen nutzen Sie folgenden Tag: &lt;a href="URL der Seite">Anzeigetext&lt;/a>

source: Picture
de: Bilder

source: To include an picturein your site, you do it like this: &lt;p>&lt;img src="path to the picture on the server" alt="The text is shown, if the picture couldn't display"/>&lt;/p> To use a picture contact the administrantor, please. Only he can upload the picture to the server and input the right path.
de: Wenn Sie Bilder in Ihre Seite einbinden möchten, machen Sie das so: &lt;p>&lt;img src="Pfad zum Bild" alt="Text, wenn das Bild nicht angezeigt werden kann"/>&lt;/p>. Um ein Bild auf der Seite anzuzeigen, benachrichtigen Sie bitten den Administrator. Dieser wird das Bild dann hochladen und den Pfad einfügen.

source: Style/ Layout:
de: Design/ Layout:

source: To make a better layout, you can use css tags. To include css- tags you use the style- argument: style="css-tag" in a HTLM- tag. It is only recommended for user knowing what they do.
de: Um ein besseres Layout zu erhalten können Sie css Tags benutzen. Diese betten Sie mit dem Argument style="css-tag" in einen HTML- Tag ein. Bitte nutzen Sie dies nur, wenn Sie wissen was Sie tun.

source: More Informations
de: Mehr Informationen

source: SelfHTML is a good HTML-school for more informations
de: SelfHTML ist eine gute HTML- Schule um mehr Informationen zu erhalten.

source: Please think about Privacy Policy and copyright!
de: Bitte beachten Sie den Datenschutz und das Copyright!

source: Page information
de: Seite

source: Title
de: Titel

source: Content
de: Inhalt

source: little html - school
de: Kleine HTML- Schule

source: What has changed?
de: Was hat sich geändert?

source: criticism
de: Kritik

source: Save
de: Speichern

source: Save redactionaly
de: Redaktions Speichern

source: Cancel
de: Abbrechen

source: Reset to confirming
de: Seite auf letzte Veröffentlichung zurücksetzen

source: Refuse Manager
de: Abweisen

source: You want to refuse this changes of the page
de: Sie möchten diese Seite abweisen.

source: Last change:
de: Stand:

source: The Editor wrote about his changes:
de: Der Verfasser schreibt folgendes über seine Änderungen:

source: The changes couldn't published because of this:
de: Die Änderungen können aus folgenden Gründen nicht übernommen werden.

source: Send refuse
de: Abweisen bestätigen

source: Cancel refuse
de: Abweisen abbrechen

source: Changes
de: Änderungen

source: Date
de: Datum

source: Display Edit
de: Vorschau

source: No changes to confirm
de: Keine Änderungen, die bestätigt werden müssen.

source: Refused pages
de: Abgelehnte Änderungen

source: Display View
de: zur Seite

source: No refused page
de: Keine abgelehnten Seite

source: pending changes
de: Unbestätigte Änderungen

source: No pending changes
de: Keine unbestätigten Änderungen

source: My pages
de: Meine Seiten

source: Other pages
de: Andere Seiten

source: Last 7 days
de: Letzte 7 Tage

source: Last 30 days
de: Letzte 30 Tage

source: No changes in the last 7 days!
de: Keine Änderungen in den letzten 7 Tagen!

source: No changes in the last 30 days!
de: Keine Änderungen in den letzten 30 Tagen!

source: No pages!
de: Keine Seiten!

source: Edit Display
de: Vorschau

source: wrote about his changes:
de: schreibt folgendes über ihre/ seine Änderungen:

source: Confirm
de: Bestätigen

source: Refuse
de: Abweisen

source: Here you can find help about this zikula module. The main idea of this modul is to make a manager of many sites with an admin adding sites, many editors, writing things on the sites and few confirmator, watching if the changes are okay.
de: Hier finden Sie Hilfe zu diesem Zikulamodul. Der Grundgedanke dieses Moduls ist es, einen Manager anzubieten, bei dem Seiten von Administrantoren hinzugefügt, von einigen Verfassern bearbeitet und einigen Zensoren überprüft werden.

source: Permissions
de: Zugangsberechtigungen

source: The administrator, adding and deleating sites has to get the Admin- Access for the Page- Zensor module. The Permissionrule shows like this: Group: The Group of Administrators, Component:"PageZensor::", Instance:"::", Permission level: "Admin access"
de: Die Administratoren, die die Seiten erstellen und auch wieder löschen müssen den Admin- Access für das PageZensor Modul bekommen. Die Zugangsroutine sieht so aus: Gruppe: Die Gruppe der Administratoren, Komponente:"PageZensus::", Instanz:"::", Zugangslevel "Admin access"

source: The editor, eding sites has to get the Moderate- Access for the Page- Zensor module. The Permissionrule shows like this: Group: The Group of Editors for one or a group of sites, Component:"PageZensor::(1|2)", Instance:"::", Permission level: "Moderate access" (In this case the group can edit page 1 and page 2.). To set the edit-access for the pages, you have to put in the clip the page-id, finding in the pagemanager
de: Die Verfasser, die die Seiten bearbeiten müssen den Moderator- Zugang bekommen. Die Zugangsroutine sieht so aus: Gruppe: Die Gruppe der Verfasser für eine oder mehrere Seiten, Komponente:"PageZensor::(1|2)", Instanze:"::", Zugangslevel: "Moderator Zugang" (In diesem Fall hat die Gruppe den Zugang für Seite 1 und 2.). Um den Verfasserzugang zu erstellen, müssen Sie die SeitenID aus der Seitenverwaltung benutzen.

source: The confirmator, confirming changes has to get the Edit- Access for the Page- Zensor module. The Permissionrule shows like this: Group: The Group of confirmators, Component:"PageZensor::", Instance:"::", Permission level: "Edit access"
de: Die Zensoren, die die Seiten bestätigen, müssen den Edit-Access erhalten. Die Zugangsroutine sieht so aus: Gruppe: Die Zensorengruppe, Komponente:"PageZensor::", Instanz:"::", Zugangslevel: "Edit access"

source: Operation
de: Funktionsweise

source: The Administrator can use the pagemanger zu create new pages by putting in a title and klicking on the green tik or to delete pages by using the rubbish.
de: Der Adminstrator kann Seiten mit der Seitenverwaltung erstellen, in dem er einen Titel eingibt und mit dem grünen Harken bestätigt. Mit dem Mülleimer löscht er die Seite.

source: The Editor can edit his pages by using the edit button on the main site in the category "my pages". To explain, what has been changed, there is the field with the title "What has changed?". Display edit shows the new site, even if it isn't confirmed. The Display shows the last confirmed site. The Mainpage show, which changes are pending, and whitch changes are remarked.
de: Der Verfasser kann die Seiten bearbeiten, in dem er auf "Bearbeiten" im der Kategory "Meine Seiten" klickt. Um zu sagen, was er geändert hat, gibt es das Feld "Was wurde geändert?". Die Ansicht der geänderten Seite zeigt die neue Seite an, auch wenn diese noch nicht bestätigt wurde. Die Ansicht zeigt die aktuelle Seite an. Die Hauptseite zeigt, welche Seite noch nicht bestätigt, oder aber abgewisen wurde.

source: The Confirmator use the edit view on the category "changes". In the opening view he can decide, if the changes, are ok, or not. If they aren't, he writes down, what isn't ok, to send the editor his remarks.
de: Die Zensoren benutzen die Ansicht "Änderungen". In der sich öffnenden Ansicht können Sie entscheiden, ob die Änderungen erlaubt werden können, oder nicht. Wenn es nicht geht, muss der Grund für die Verfasser aufgeschrieben werden.

source: Startmodule
de: Startmodul

source: To get this module as startmodule, you have to set "PageZensor" as startmodule. The type is "user" and the func is "main". You choose the page by choosing this page as "Mainpage" in the "Page Manager"
de: Um dieses Modul als Startmodul für Zikula zu verwenden, muss "PageZensor" als Startmodul gesetzt werden. Der Typ ist dann "User" und die Funktion ist "main". Die Seite wird dann in der Seitenverwaltung mit "Hauptseite" ausgewählt.

source: Delete page
de: Seite Löschen

source: Do you realy want to delete the page?
de: Möchten Sie wirklich die Seite löschen?

source: Warning! Deleting of the page is permanently and not removable!
de: Warnung! Gelöschte Seiten können nicht wiederhergestellt werden.

source: Delete
de: Löschen

source: Mainpage
de: Hauptseite
